Revit 2027 API
Document.PlanTopologies Property
Get the PlanTopologies of the current project in the last phase.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PlanTopologySet PlanTopologies { get; }
Public ReadOnly Property PlanTopologies As PlanTopologySet
	Get
public:
property PlanTopologySet^ PlanTopologies {
	PlanTopologySet^ get ();
}
member PlanTopologies : PlanTopologySet with get
Property Value
PlanTopologySet
Remarks
Accessing plan topologies requires that document is modifiable as it will actually trigger calculating plan topologies if they have not been calculated yet. The time necessary for the calculations may be significant and should be considered.
See Also
Reference
Document Class
PlanTopologies Overload
Autodesk.Revit.DB Namespace